{
  "ground_values": {
    "What are the main approaches in artificial intelligence?": [1, 2, 4],
    "How does modern AI differ in terminology and presentation?": [1, 2],
    "Which topics are introduced in AI lecture notes?": [3],
    "What were the proceedings of the 19th IJCAI conference?": [5],
    "How does AI improve performance in medicine?": [6, 10],
    "What is the connection between integer programming and AI?": [7],
    "How is AI applied in radiology?": [8],
    "What are multi-agent systems and their role in distributed AI?": [9],
    "What is the historical evolution of AI in healthcare?": [10],
    "What concepts and challenges are covered in Explainable AI (XAI)?": [11],
    "How do social sciences inform explanations in AI?": [13],
    "What are philosophical problems viewed from the AI perspective?": [14],
    "How can simulated evolution be used in AI research?": [15],
    "What are AI applications in service industries?": [16],
    "What surveys exist on Explainable AI (XAI)?": [17],
    "How is AI used in machine learning approaches?": [18],
    "What is the potential for AI in healthcare?": [19],
    "How do multi-agent systems introduce distributed AI concepts?": [20],
    "What guides intelligent systems in AI?": [21],
    "How is AI applied in healthcare?": [22],
    "What are the foundational concepts in the Handbook of AI?": [23],
    "How is AI applied in medicine?": [24],
    "Which AI methods are covered in a modern approach?": [25],
    "How does AI relate to statistics?": [26],
    "What were the topics in the 2009 IJCAI conference?": [27],
    "What were the proceedings of the 2007 IJCAI conference?": [28],
    "How has AI evolved historically?": [29],
    "How is uncertainty modeled in AI?": [30],
    "What are the logical foundations of AI?": [31],
    "How is AI applied in education?": [32],
    "Which problem-solving methods are used in AI?": [33],
    "How is probabilistic machine learning connected to AI?": [34],
    "Which encyclopedia provides AI knowledge?": [35],
    "What are early steps toward AI?": [36],
    "What were the proceedings of IJCAI '99?": [37],
    "How can AI be synthesized in a new approach?": [38],
    "What is neuroscience-inspired AI?": [39],
    "How is AI applied in higher education research?": [40],
    "Which resources introduce AI?": [41],
    "How is AI used in machine learning?": [42],
    "What were the proceedings of the 19th AI and Statistics conference 2016?": [43],
    "How are AI technologies implemented in medicine?": [44],
    "What is Bayesian AI?": [45],
    "Which foundational works describe AI?": [46],
    "How is XAI applied in explainable AI?": [47],
    "How is Prolog used in AI programming?": [48],
    "How does AI contribute to sustainable development goals?": [49],
    "What were the proceedings of the National AI conference?": [50]
  }
}